In [19]:
import pandas as pd
from glob import glob

In [20]:
filepaths=glob('C:/Users\polif/Documents/MYpython/*.xlsx')
filepaths

['C:/Users\\polif/Documents/MYpython\\2017年7月売上実績.xlsx',
 'C:/Users\\polif/Documents/MYpython\\2017年8月売上実績.xlsx',
 'C:/Users\\polif/Documents/MYpython\\2017年9月売上実績.xlsx']

In [21]:
filepath=filepaths[0]
filepath

'C:/Users\\polif/Documents/MYpython\\2017年7月売上実績.xlsx'

In [22]:
_df=pd.read_excel(filepath)
_df

  2017年7月売上実績 Unnamed: 1 Unnamed: 2       道長
0         NaN        NaN        NaN       N社
1         NaN        NaN        NaN      NaN
2         NaN       パソコン       プリンタ  デジタルカメラ
3        東京支店      10830       2150     1540
4       名古屋支店       7690       1650     2150
5        大阪支店       9850       1840     1280

In [23]:
columns=_df.iloc[2,[0,1,2,3]]
columns

2017年7月売上実績        NaN
Unnamed: 1        パソコン
Unnamed: 2        プリンタ
道長             デジタルカメラ
Name: 2, dtype: object

In [24]:
df=_df.iloc[3:7,[0,1,2,3]]

In [25]:
df

  2017年7月売上実績 Unnamed: 1 Unnamed: 2    道長
3        東京支店      10830       2150  1540
4       名古屋支店       7690       1650  2150
5        大阪支店       9850       1840  1280

In [26]:
df.columns=columns

In [27]:
df

2    NaN   パソコン  プリンタ デジタルカメラ
3   東京支店  10830  2150    1540
4  名古屋支店   7690  1650    2150
5   大阪支店   9850  1840    1280

In [28]:
df['企業名']=_df.iloc[0,3]

In [29]:
df

2    NaN   パソコン  プリンタ デジタルカメラ 企業名
3   東京支店  10830  2150    1540  N社
4  名古屋支店   7690  1650    2150  N社
5   大阪支店   9850  1840    1280  N社

In [30]:
def extract(filepath):
    _df=pd.read_excel(filepath)
    columns=_df.iloc[2,[0,1,2,3]]
    df=_df.iloc[3:6,[0,1,2,3]]
    df.columns=columns
    df['企業名']=_df.iloc[0,3]
    return df

In [31]:
df=extract(filepath)
df

2    NaN   パソコン  プリンタ デジタルカメラ 企業名
3   東京支店  10830  2150    1540  N社
4  名古屋支店   7690  1650    2150  N社
5   大阪支店   9850  1840    1280  N社

In [32]:
sample_1=pd.DataFrame([[1,2,3],[4,5,6]])
sample_2=pd.DataFrame([[-1,-5,-7],['d','j','m']])
sample_1

   0  1  2
0  1  2  3
1  4  5  6

In [33]:
pd.concat([sample_1,sample_2],axis=1)

   0  1  2   0   1   2
0  1  2  3  -1  -5  -7
1  4  5  6   d   j   m

In [34]:
df=pd.DataFrame()
for filepath in filepaths:
    _df=extract(filepath)
    df=pd.concat([df,_df])

In [35]:
df

2    NaN   パソコン  プリンタ デジタルカメラ 企業名
3   東京支店  10830  2150    1540  N社
4  名古屋支店   7690  1650    2150  N社
5   大阪支店   9850  1840    1280  N社
3   東京支店  12580  3200    2850  P社
4  名古屋支店  10950  2100    2280  P社
5   大阪支店  12450  2850    2480  P社
3   東京支店  11250  2500    2100  D社
4  名古屋支店   9500  1750    1950  D社
5   大阪支店  13450  3250    2550  D社

In [36]:
df=df.iloc[:,[0,4,1,2,3]]
df

2    NaN 企業名   パソコン  プリンタ デジタルカメラ
3   東京支店  N社  10830  2150    1540
4  名古屋支店  N社   7690  1650    2150
5   大阪支店  N社   9850  1840    1280
3   東京支店  P社  12580  3200    2850
4  名古屋支店  P社  10950  2100    2280
5   大阪支店  P社  12450  2850    2480
3   東京支店  D社  11250  2500    2100
4  名古屋支店  D社   9500  1750    1950
5   大阪支店  D社  13450  3250    2550

In [41]:
df.to_excel('C:/Users\polif/Documents/MYpython/all_data.xlsx',index=False)